# Data Wrangling

In [ ]:
#Data wrangling is also known as data munging.The process of transforming or organizing the raw data in to a format thet is easier to analyze
#steps of data wrangling
# 1.Discover data
# 2.Structure
# 3.cleaning the data
# 4.Validate
# 4.publish

#after data wrangling,it is easy to do data analysis
#improved data quality
#improved data quality and consistency
#Increased analysis expression
#enhanced reproducibility
#decision making and reduced error

# Data wrangling techniques
# Merge

In [ ]:
#if you have two lists of ingredients and want to combine them based on whats common between them,you would use merge

In [ ]:
import pandas as pd

In [1]:
#creating two data frames
import pandas as pd
students=pd.DataFrame({'Student_ID':[101,102,103],
                       'Name':['Alice','Bob','Smith']
                      })
scores=pd.DataFrame({'Student_ID':[101,104,105],
                     'Score':[85,90,95]})

Merge=pd.merge(students,scores,on='Student_ID')
print(Merge)

   Student_ID   Name  Score
0         101  Alice     85

In [3]:
join=pd.merge(students,scores,on='Student_ID',how='inner')
print(join)

   Student_ID   Name  Score
0         101  Alice     85

In [4]:
leftjoin=pd.merge(students,scores,on='Student_ID',how='left')
print(leftjoin)

   Student_ID   Name  Score
0         101  Alice   85.0
1         102    Bob    NaN
2         103  Smith    NaN

In [5]:
rightjoin=pd.merge(students,scores,on='Student_ID',how='right')
print(rightjoin)

   Student_ID   Name  Score
0         101  Alice     85
1         104    NaN     90
2         105    NaN     95

# Concat

In [8]:
classA=pd.DataFrame({'Name':['Ram','Rena','Sam','Guna'],'Grade':[1,2,3,4],'Percent':[90,97,95,96]})
classA
classB=pd.DataFrame({'Name':['Ramana','RenaRaj','Samantha','Gunasekhar'],'Grade':[3,1,3,4],'Percent':[93,97,94,96]})
classB

         Name  Grade  Percent
0      Ramana      3       93
1     RenaRaj      1       97
2    Samantha      3       94
3  Gunasekhar      4       96

In [14]:
concat_data=pd.concat([classA,classB],ignore_index='True')
concat_data

         Name  Grade  Percent
0         Ram      1       90
1        Rena      2       97
2         Sam      3       95
3        Guna      4       96
4      Ramana      3       93
5     RenaRaj      1       97
6    Samantha      3       94
7  Gunasekhar      4       96

# GroupBy

In [23]:
data=pd.DataFrame({'SalesPerson':['Shaobana','Sahasra','Sarayu','Sruthi'],
       'product':['ornaments','Fabric','silver','Furniture'],
       'Sales':[100000,50000,90000,80000]})
data

  SalesPerson    product   Sales
0    Shaobana  ornaments  100000
1     Sahasra     Fabric   50000
2      Sarayu     silver   90000
3      Sruthi  Furniture   80000

In [30]:
df=pd.DataFrame(data)
grp_data=df.groupby('SalesPerson')['Sales'].sum()
print(grp_data)

SalesPerson
Sahasra      50000
Sarayu       90000
Shaobana    100000
Sruthi       80000
Name: Sales, dtype: int64

In [31]:
print("Columns:", df.columns.tolist())

Columns: ['SalesPerson', 'product', 'Sales']

In [32]:
print("\nMissing Values:")
print(df.isnull().sum())

Missing Values:
SalesPerson    0
product        0
Sales          0
dtype: int64

In [4]:
string='Hello python'
string.split()

['Hello', 'python']

In [8]:
string='Hello python'
rev_string = ""
for char in string:
    rev_string = char + rev_string    
print(rev_string)

nohtyp olleH